docs: redesign README
